In [1]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
gdp = pd.read_csv("data/gdp.csv")
capita = pd.read_csv("data/capita.csv")
debt = pd.read_csv("data/debt.csv")
inflation = pd.read_csv("data/inflation.csv")
rate = pd.read_csv("data/rate.csv")
manufact = pd.read_csv("data/manufacturing.csv")

In [3]:
gdp.head(2)

,Country Name,2018,2017,2016,2015,2014
0,United States,"$20,580,159,776,000","$19,519,353,692,000","$18,714,960,538,000","$18,224,704,440,000","$17,527,163,695,000"
1,China,"$13,894,817,549,374","$12,310,409,370,893","$11,233,276,536,737","$11,061,553,079,876","$10,475,682,920,595"

In [4]:
capita.head(2)

,Country Name,2018,2017,2016,2015,2014
0,United States,"$20,580,159,776,000","$19,519,353,692,000","$18,714,960,538,000","$18,224,704,440,000","$17,527,163,695,000"
1,China,"$13,894,817,549,374","$12,310,409,370,893","$11,233,276,536,737","$11,061,553,079,876","$10,475,682,920,595"

In [5]:
debt.head(2)

,Country Name,2018,2017,2016,2015,2014
0,United States,"$20,580,159,776,000","$19,519,353,692,000","$18,714,960,538,000","$18,224,704,440,000","$17,527,163,695,000"
1,China,"$13,894,817,549,374","$12,310,409,370,893","$11,233,276,536,737","$11,061,553,079,876","$10,475,682,920,595"

In [5]:
inflation.head(2)

,Country Name,2018,2017,2016,2015,2014
0,United States,"$20,580,159,776,000","$19,519,353,692,000","$18,714,960,538,000","$18,224,704,440,000","$17,527,163,695,000"
1,China,"$13,894,817,549,374","$12,310,409,370,893","$11,233,276,536,737","$11,061,553,079,876","$10,475,682,920,595"

In [8]:
rate.head(2)

,Country Name,2018,2017,2016,2015,2014
0,United States,"$20,580,159,776,000","$19,519,353,692,000","$18,714,960,538,000","$18,224,704,440,000","$17,527,163,695,000"
1,China,"$13,894,817,549,374","$12,310,409,370,893","$11,233,276,536,737","$11,061,553,079,876","$10,475,682,920,595"

In [7]:
manufact.head(2)

,Country Name,2018,2017,2016,2015,2014
0,United States,"$20,580,159,776,000","$19,519,353,692,000","$18,714,960,538,000","$18,224,704,440,000","$17,527,163,695,000"
1,China,"$13,894,817,549,374","$12,310,409,370,893","$11,233,276,536,737","$11,061,553,079,876","$10,475,682,920,595"